# @Time : 20-12-29 下午5:11
# @Author : codersheep
# @File : config.py
# @Description :

# 圆机标签
labels_circle_machine = {
    '背景': 0,
    '飞花': 1,
    '纱结': 2,
    '粗细纱': 3,
    '坏针': 4,
    '竖条': 5,
    '横条': 6,
    '油污': 7,
    '破洞': 8,
}

labels_circle_machine_yolov8 = {
    '飞花': 0,
    '纱结': 1,
    '粗细纱': 2,
    '坏针': 3,
    '竖条': 4,
    '横条': 5,
    '油污': 6,
    '破洞': 7,
}

labels_circle_machine_mapping = {
    'background': 0,
    # 飞花类
    '飞花': 1,
    '异纤飞花': 1,
    '异纤/飞花': 1,
    '5_异纤/飞花': 1,
    '飞花/异纤': 1,
    '飞毛': 1,
    '异纤': 1,
    '飞花异纤': 1,
    # 纱结类
    '纱结': 2,
    '7_纱结': 2,
    # 粗细纱类
    '粗细纱': 3,
    # 坏针类
    '花针': 4,
    '烂针': 4,
    '坏针': 4,
    '短坏针': 4,
    # 竖条类
    '针路': 5,
    '竖条': 5,
    '油针': 5,
    # 横条类
    '横条': 6,
    '横档': 6,
    '破铜': 6,
    '断纱': 6,
    # 油污类
    '油污': 7,
    '油点': 7,
    '脏污': 7,
    '污渍': 7,
    '脏纱': 7,
    '8_脏污': 7,
    # 破洞类
    '破洞': 8,
    '小破洞': 8,
    '漏针': 8,
}

labels_yanbuji = {
    '横条': 0,
    '破洞': 1,
    '断纱': 2,
    '烂针': 3,
    '异纤': 4,
    '烂边': 5,
    '纱结': 6,
    '脏污': 7,
    '色污': 8,
    '勾纱': 9,
    '擦伤': 10,
    '竖条': 11,
    '色花': 12,
    '折痕': 13,
    '水印': 14,
    '停机横': 15,
    '断氨纶': 16,
    '反丝': 17,
    '棉点': 18,
    '其它': 19,
    '色点': 20,
    '缝头线': 21,
    '熔氨纶': 22,
    '针路': 23,
    '粗细纱': 24
}

labels_circle_machine_yanbuji_mapping = {
    'background': 0,
    # 飞花类
    '飞花': 1,
    '飞花/异纤': 1,
    '飞毛': 1,
    '飞花异纤': 1,

    # 纱结类
    '纱结': 2,
    '7_纱结': 2,

    # 粗细纱类
    '粗细纱': 3,

    # 坏针类
    '花针': 4,
    '烂针': 4,
    '坏针': 4,
    '短坏针': 4,

    # 竖条类
    '针路': 5,
    '竖条': 5,
    '油针': 5,

    # 横条类
    '横条': 6,
    '横档': 6,
    '破铜': 6,
    '停机横': 6,

    # 油污类
    '油污': 7,
    '油点': 7,
    '污渍': 7,

    # 破洞类
    '破洞': 8,
    '小破洞': 8,
    '漏针': 8,

    # 烂边类
    '烂边': 9,

    # 异纤类
    '异纤': 10,
    '异纤飞花': 10,
    '异纤/飞花': 10,
    '5_异纤/飞花': 10,
    '棉点': 10,

    # 断纱类
    '断纱': 11,
    '断氨纶': 11,

    # 勾纱类
    '勾纱': 12,

    # 折痕类
    '折痕': 13,

    # 反丝类
    '反丝': 14,

    # 缝头线类
    '缝头线': 15,

    # 异色类
    '脏污': 16,
    '脏纱': 16,
    '8_脏污': 16,
    '色污': 16,
    '色花': 16,
    '擦伤': 16,
    '水印': 16,
    '融氨纶': 16,

    # 其他类
    '其他': 17,

}

yolov8_yanbuji_mapping = {
    '飞花': 0,
    '纱结': 1,
    '粗细纱': 2,
    '坏针': 3,
    '竖条': 4,
    '横条': 5,
    '油污': 6,
    '破洞': 7,
    '烂边': 8,
    '异纤': 9,
    '断纱': 10,
    '勾纱': 11,
    '折痕': 12,
    '反丝': 13,
    '缝头线': 14,
    '异色': 15,
    '其他': 16,

}

# 标签的颜色划分
label_color = [
    [0, 0, 0],  # 背景-颜色
    [0, 102, 102],  # 飞花
    [255, 228, 255],  # 纱结 - MistyRose
    [160, 32, 240],  # 粗细纱 - 紫色
    [0, 255, 0],  # 坏针 - 绿色
    [255, 165, 0],  # 竖条 - 橘色
    [255, 0, 0],  # 横条 - 红色
    [255, 255, 0],  # 油污 - 黄色
    [0, 0, 255],  # 破洞 - 蓝色
    [152, 0, 102],
    [152, 102, 0],
]

label_yanbuji_color = [
    [0, 0, 0],
    [0, 102, 102],
    [0, 51, 204],
    [0, 204, 0],
    [102, 0, 102],
    [102, 102, 102],
    [204, 102, 0],
    [255, 204, 0],
    [51, 0, 0],
    [153, 0, 102],
    [102, 153, 102],
    [153, 255, 0],
    [204, 153, 0],
    [255, 51, 255],
    [0, 51, 0],
    [153, 204, 255],
    [255, 255, 151],
    [255, 0, 0],
    [204, 255, 102],
    [255, 255, 204],
    [255, 204, 255],
    [75, 0, 130],
    [51, 51, 51],
    [51, 102, 102],
    [102, 102, 51],
    [15, 30, 255]
]
